# Ultralytics YOLO 🚀, GPL-3.0 license

# My Change:
#  1. SPPF-->SimSPPF 
#  2. 

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
#   - [-1, 1, GhostConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
  
#   - [-1, 1, SE, [1024]] #SE #10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  
  - [6, 1, SE, [512]] #SE #11
  
  - [[-1, -2], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13


  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  
  - [4, 1, SE, [256]] #SE #15
  
  - [[-1, -2], 1, Concat, [1]]  
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)


  - [-1, 1, Conv, [256, 3, 2]]  
  
  - [11, 1, SE, [512]] #SE ############2
    
  - [[-1, -2], 1, Concat, [1]] 
  - [-1, 3, C2f, [512]]  # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  
#   - [9, 1, SE, [1024]] #SE ############2
  
  - [[-1, 9], 1, Concat, [1]]  
  - [-1, 3, C2f, [1024]]  # 25   
  

  - [17, 1, nn.Upsample, [None, 2, 'nearest']]#版本6///////////////  #24
  - [2, 1, SE, [128]] #SE   
  - [[-1, -2], 1, Concat, [1]]  
  - [-1, 3, C2f, [128]]  #29    (xiaoxioa tou)
  
  - [[-1,17, 21, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
