# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  #2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   #4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]  #6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:

  - [6, 1, Conv, [1024, 3, 2]] #F1
  - [[-1, 9], 1, Concat, [1]]  
  - [-1, 3, C2f, [1024, True]]  #12
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #F2   13
  - [4, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [[-1, 6,13], 1, Concat, [1]]  
  - [-1, 3, C2f, [512, True]]  #16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #F3    17
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 3, C2f, [256, True]]  #19
  
  - [-1, 3, C2f, [256, True]]  #F4         #20  
  
  - [-1, 1, Conv, [256, 3, 2]] #F5   256x2 ？
  - [19, 1, Conv, [256, 3, 2]]  
  - [[-1, 21,16], 1, Concat, [1]] 
  - [-1, 3, C2f, [512, True]]  #24
  
  
  
  - [-1, 1, Conv, [512, 3, 2]] #F6   25    512x2 ？
  - [16, 1, Conv, [512, 3, 2]] 
  - [[-1, 25,12], 1, Concat, [1]] 
  - [-1, 3, C2f, [1024, True]]  #28
  
  - [[20, 24, 28], 1, Detect, [nc]]  # Detect(P3, P4, P5)

  
  
  
  
#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#   - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
#   - [-1, 3, C2f, [512]]  # 13

#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#   - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
#   - [-1, 3, C2f, [256]]  # 17 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 12], 1, Concat, [1]]  # cat head P4
#   - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 9], 1, Concat, [1]]  # cat head P5
#   - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)

# #   - [[3, 15], 1, Concat, [1]]  # cat backbone P3////
# #   - [[-1, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
#   - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
